
{$IFDEF FPC}
  {$MODE Delphi}
{$ENDIF} 

library NewFunc;

 //**************************************************************************//
 //                 Модуль функций доступа к БД через ADO                    //
 //**************************************************************************//
 // Данный исходный код является составной частью системы SimInTech          //
 // Авторские права на данный код принадлежат ООО 3В-Сервис                  //
 //       Авторы:  Тимофеев К.А.                                             //
 //**************************************************************************//


uses
  simmm,
  Info;

{$R *.res}

  //Эта функция возвращает адрес структуры DllInfo
function  GetEntry:Pointer;
begin
  Result := @DllInfo;
end;

exports
  GetEntry     name 'GetEntry',     //Функция получения адреса структуры DllInfo
  CreateObject name 'CreateObject'; //Функция создания объекта

begin
end.
